Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
#include <Arduino.h>
#include <WiFi.h>
#include "esp_camera.h"
#include "esp_http_server.h"
#include "esp_heap_caps.h"
#include "img_converters.h"
#include "esp_arduino_version.h"

#include "mechanical_ocr_types.h"
#include "mechanical_templates_int8.h"

static_assert(
    MECH_INT8_TEMPLATE_COUNT == 38 &&
    MECH_INT8_TEMPLATE_H == 64 &&
    MECH_INT8_TEMPLATE_W == 40,
    "Wrong mechanical_templates_int8.h - expected the validated 38 x 40 x 64 header.");



// ============================================================================
// MachineSens - Mechanical Roller Meter ESP32-CAM FINAL - USER VALIDATED INT8 - COMPILE FIX
// UI matched to the user's existing MachineSens digital-meter setup page.
//
// OCR path is a direct embedded port of the Python reader that passed INT8 parity:
//   - frozen 38-template int8 header (0/127)
//   - Python mask first (S<110), RGB565-safe S<125 only as guarded rescue
//   - same connected-components filters
//   - same 40x64 centering with area-weighted resize
//   - same +/-2 shifted correlation
//   - same targeted 5-vs-6 fix
//
// V2.1 adds:
//   - MachineSens dark two-column UI
//   - VGA live camera on port 81
//   - XGA still capture for OCR
//   - crop canvas + BEFORE/AFTER decimal selectors
//   - camera controls
//   - detailed per-digit result panel
// ============================================================================

const char* AP_SSID = "Mechanical_Meter_Test";
const char* AP_PASSWORD = "12345678";

#define PWDN_GPIO_NUM 32
#define RESET_GPIO_NUM -1
#define XCLK_GPIO_NUM 0
#define SIOD_GPIO_NUM 26
#define SIOC_GPIO_NUM 27
#define Y9_GPIO_NUM 35
#define Y8_GPIO_NUM 34
#define Y7_GPIO_NUM 39
#define Y6_GPIO_NUM 36
#define Y5_GPIO_NUM 21
#define Y4_GPIO_NUM 19
#define Y3_GPIO_NUM 18
#define Y2_GPIO_NUM 5
#define VSYNC_GPIO_NUM 25
#define HREF_GPIO_NUM 23
#define PCLK_GPIO_NUM 22
#define FLASH_LED_PIN 4

constexpr framesize_t STREAM_FRAME_SIZE = FRAMESIZE_VGA;
constexpr int STREAM_JPEG_QUALITY = 11;
constexpr framesize_t CAPTURE_FRAME_SIZE = FRAMESIZE_XGA;
constexpr int CAPTURE_JPEG_QUALITY = 3;

constexpr int DECODE_W = 1024;
constexpr int DECODE_H = 768;

constexpr uint16_t MAIN_SERVER_PORT = 80;
constexpr uint16_t STREAM_SERVER_PORT = 81;

constexpr uint32_t STREAM_STOP_TIMEOUT_MS = 3500;
constexpr uint32_t CAMERA_MUTEX_TIMEOUT_MS = 10000;
constexpr float STILL_DARK_MEAN_THRESHOLD = 82.0f;

httpd_handle_t mainServer = nullptr;
httpd_handle_t streamServer = nullptr;
SemaphoreHandle_t cameraMutex = nullptr;

volatile bool streamPauseRequested = false;
volatile bool streamClientActive = false;

uint8_t* latestJpeg = nullptr;
size_t latestJpegLen = 0;
int latestJpegW = 0;
int latestJpegH = 0;


struct CameraUiSettings {
  int brightness = 0;
  int contrast = 0;
  int saturation = 0;
  int sharpness = 0;
  int denoise = 0;
  int specialEffect = 0;

  bool whiteBalance = true;
  bool awbGain = true;
  int wbMode = 0;

  bool exposureControl = true;
  bool aec2 = false;
  int aeLevel = 0;
  int aecValue = 300;

  bool gainControl = true;
  int agcGain = 0;
  int gainCeiling = 2;

  bool blackPixelCorrection = true;
  bool whitePixelCorrection = true;
  bool rawGamma = true;
  bool lensCorrection = true;
  bool downsize = true;

  bool horizontalMirror = false;
  bool verticalFlip = false;

  bool flashEnabled = false;
  int flashBrightness = 80;

  int captureWarmupMs = 700;
  int framesToDiscard = 4;
};

CameraUiSettings camUi;

static void clearLatestJpeg() {
  if (latestJpeg) {
    free(latestJpeg);
    latestJpeg = nullptr;
  }

  latestJpegLen = 0;
  latestJpegW = 0;
  latestJpegH = 0;
}


static void initialiseFlashPWM() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(FLASH_LED_PIN, 5000, 8);
  ledcWrite(FLASH_LED_PIN, 0);
#else
  constexpr uint8_t FLASH_LEDC_CHANNEL = 7;
  ledcSetup(FLASH_LEDC_CHANNEL, 5000, 8);
  ledcAttachPin(FLASH_LED_PIN, FLASH_LEDC_CHANNEL);
  ledcWrite(FLASH_LEDC_CHANNEL, 0);
#endif
}

static void setFlashBrightness(uint8_t brightness) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(FLASH_LED_PIN, brightness);
#else
  constexpr uint8_t FLASH_LEDC_CHANNEL = 7;
  ledcWrite(FLASH_LEDC_CHANNEL, brightness);
#endif
}

static void applyCameraUiSettings() {
  sensor_t* s = esp_camera_sensor_get();

  if (!s) {
    return;
  }

  if (s->set_brightness) {
    s->set_brightness(s, constrain(camUi.brightness, -2, 2));
  }

  if (s->set_contrast) {
    s->set_contrast(s, constrain(camUi.contrast, -2, 2));
  }

  if (s->set_saturation) {
    s->set_saturation(s, constrain(camUi.saturation, -2, 2));
  }

  if (s->set_sharpness) {
    s->set_sharpness(s, constrain(camUi.sharpness, -2, 2));
  }

  if (s->set_denoise) {
    s->set_denoise(s, constrain(camUi.denoise, 0, 8));
  }

  if (s->set_special_effect) {
    s->set_special_effect(s, constrain(camUi.specialEffect, 0, 6));
  }

  if (s->set_whitebal) {
    s->set_whitebal(s, camUi.whiteBalance ? 1 : 0);
  }

  if (s->set_awb_gain) {
    s->set_awb_gain(s, camUi.awbGain ? 1 : 0);
  }

  if (s->set_wb_mode) {
    s->set_wb_mode(s, constrain(camUi.wbMode, 0, 4));
  }

  if (s->set_exposure_ctrl) {
    s->set_exposure_ctrl(s, camUi.exposureControl ? 1 : 0);
  }

  if (s->set_aec2) {
    s->set_aec2(s, camUi.aec2 ? 1 : 0);
  }

  if (s->set_ae_level) {
    s->set_ae_level(s, constrain(camUi.aeLevel, -2, 2));
  }

  if (s->set_aec_value) {
    s->set_aec_value(s, constrain(camUi.aecValue, 0, 1200));
  }

  if (s->set_gain_ctrl) {
    s->set_gain_ctrl(s, camUi.gainControl ? 1 : 0);
  }

  if (s->set_agc_gain) {
    s->set_agc_gain(s, constrain(camUi.agcGain, 0, 30));
  }

  if (s->set_gainceiling) {
    s->set_gainceiling(
        s,
        static_cast<gainceiling_t>(
            constrain(camUi.gainCeiling, 0, 6)));
  }

  if (s->set_bpc) {
    s->set_bpc(s, camUi.blackPixelCorrection ? 1 : 0);
  }

  if (s->set_wpc) {
    s->set_wpc(s, camUi.whitePixelCorrection ? 1 : 0);
  }

  if (s->set_raw_gma) {
    s->set_raw_gma(s, camUi.rawGamma ? 1 : 0);
  }

  if (s->set_lenc) {
    s->set_lenc(s, camUi.lensCorrection ? 1 : 0);
  }

  if (s->set_dcw) {
    s->set_dcw(s, camUi.downsize ? 1 : 0);
  }

  if (s->set_hmirror) {
    s->set_hmirror(s, camUi.horizontalMirror ? 1 : 0);
  }

  if (s->set_vflip) {
    s->set_vflip(s, camUi.verticalFlip ? 1 : 0);
  }

  // Flash is intentionally OFF during live view.
  // It is applied only during the high-quality still capture.
  setFlashBrightness(0);
}

static bool getQueryString(httpd_req_t* req, const char* key, String& value) {
  const size_t len = httpd_req_get_url_query_len(req);
  if (len == 0) return false;

  char* query = static_cast<char*>(malloc(len + 1));
  if (!query) return false;

  bool ok = false;

  if (httpd_req_get_url_query_str(req, query, len + 1) == ESP_OK) {
    char buffer[64];
    if (httpd_query_key_value(query, key, buffer, sizeof(buffer)) == ESP_OK) {
      value = String(buffer);
      ok = true;
    }
  }

  free(query);
  return ok;
}

static bool getQueryInt(httpd_req_t* req, const char* key, int& value) {
  String text;
  if (!getQueryString(req, key, text)) return false;
  value = text.toInt();
  return true;
}

static esp_err_t sendJson(httpd_req_t* req, const String& json, int status = 200) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");

  if (status == 400) httpd_resp_set_status(req, "400 Bad Request");
  else if (status == 404) httpd_resp_set_status(req, "404 Not Found");
  else if (status == 500) httpd_resp_set_status(req, "500 Internal Server Error");

  return httpd_resp_send(req, json.c_str(), json.length());
}


// ============================================================================
// FINAL MECHANICAL INT8 OCR
//
// Desktop parity already validated:
//   ORIGINAL PYTHON == INT8 PYTHON
//
// Embedded path:
//   retained still JPEG -> RGB565 -> crop
//   -> Python S<110 mask
//   -> guarded S<125 rescue only when RGB565 quantization needs it
//   -> Otsu V threshold, clamp 65..135
//   -> 2x2 close
//   -> 8-connected components
//   -> 40x64 area-resized normalized digits
//   -> +/-2 shifted Pearson correlation against frozen INT8 templates
//   -> exact targeted 5-vs-6 hole rule
// ============================================================================

static void mechSetError(
    MechanicalOcrResult* out,
    const char* message) {
  if (!out) {
    return;
  }

  out->success = false;

