Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
  strncpy(
      out->error,
      message ? message : "Unknown mechanical OCR error",
      sizeof(out->error) - 1);

  out->error[
      sizeof(out->error) - 1] =
      '\0';
}

static inline uint8_t mechR5To8(uint16_t pixel) {
  return static_cast<uint8_t>(
      ((((pixel >> 11) & 0x1F) * 255U) / 31U));
}

static inline uint8_t mechG6To8(uint16_t pixel) {
  return static_cast<uint8_t>(
      ((((pixel >> 5) & 0x3F) * 255U) / 63U));
}

static inline uint8_t mechB5To8(uint16_t pixel) {
  return static_cast<uint8_t>(
      (((pixel & 0x1F) * 255U) / 31U));
}

// OpenCV HSV S/V equivalent needed by the Python preprocessing.
static inline void mechSVFromRgb565(
    uint16_t pixel,
    uint8_t& saturation,
    uint8_t& value) {
  const uint8_t r = mechR5To8(pixel);
  const uint8_t g = mechG6To8(pixel);
  const uint8_t b = mechB5To8(pixel);

  const uint8_t maximum =
      max(r, max(g, b));

  const uint8_t minimum =
      min(r, min(g, b));

  value =
      maximum;

  saturation =
      (maximum == 0)
          ? 0
          : static_cast<uint8_t>(
                (static_cast<uint16_t>(
                     maximum - minimum) *
                 255U) /
                maximum);
}

static int mechOtsuThreshold(
    const uint32_t histogram[256],
    uint32_t totalPixels) {
  if (totalPixels == 0) {
    return 90;
  }

  uint64_t totalWeighted = 0;

  for (int i = 0;
       i < 256;
       ++i) {
    totalWeighted +=
        static_cast<uint64_t>(i) *
        histogram[i];
  }

  uint64_t backgroundWeighted = 0;
  uint32_t backgroundCount = 0;

  double bestVariance = -1.0;
  int bestThreshold = 90;

  for (int threshold = 0;
       threshold < 256;
       ++threshold) {
    backgroundCount +=
        histogram[threshold];

    if (backgroundCount == 0) {
      continue;
    }

    const uint32_t foregroundCount =
        totalPixels -
        backgroundCount;

    if (foregroundCount == 0) {
      break;
    }

    backgroundWeighted +=
        static_cast<uint64_t>(
            threshold) *
        histogram[threshold];

    const double meanBackground =
        static_cast<double>(
            backgroundWeighted) /
        backgroundCount;

    const double meanForeground =
        static_cast<double>(
            totalWeighted -
            backgroundWeighted) /
        foregroundCount;

    const double difference =
        meanBackground -
        meanForeground;

    const double variance =
        static_cast<double>(
            backgroundCount) *
        static_cast<double>(
            foregroundCount) *
        difference *
        difference;

    if (variance > bestVariance) {
      bestVariance =
          variance;

      bestThreshold =
          threshold;
    }
  }

  return bestThreshold;
}

static uint8_t* mechMakeMask(
    const uint16_t* frame,
    int frameWidth,
    int frameHeight,
    int roiX,
    int roiY,
    int roiWidth,
    int roiHeight,
    int saturationLimit) {
  if (!frame ||
      frameWidth <= 0 ||
      frameHeight <= 0 ||
      roiWidth <= 0 ||
      roiHeight <= 0) {
    return nullptr;
  }

  roiX =
      max(0, roiX);

  roiY =
      max(0, roiY);

  if (roiX + roiWidth >
      frameWidth) {
    roiWidth =
        frameWidth -
        roiX;
  }

  if (roiY + roiHeight >
      frameHeight) {
    roiHeight =
        frameHeight -
        roiY;
  }

  if (roiWidth <= 0 ||
      roiHeight <= 0) {
    return nullptr;
  }

  uint32_t histogram[256] = {0};
  uint32_t valueCount = 0;

  // Python:
  // values = val[sat < 110]
  for (int y = 0;
       y < roiHeight;
       ++y) {
    const uint16_t* row =
        frame +
        (roiY + y) *
            frameWidth +
        roiX;

    for (int x = 0;
         x < roiWidth;
         ++x) {
      uint8_t saturation;
      uint8_t value;

      mechSVFromRgb565(
          row[x],
          saturation,
          value);

      if (saturation <
          saturationLimit) {
        histogram[value]++;
        valueCount++;
      }
    }
  }

  int threshold =
      90;

  if (valueCount > 100) {
    threshold =
        mechOtsuThreshold(
            histogram,
            valueCount);
  }

  threshold =
      constrain(
          threshold,
          65,
          135);

  const size_t pixelCount =
      static_cast<size_t>(
          roiWidth) *
      roiHeight;

  uint8_t* mask =
      static_cast<uint8_t*>(
          heap_caps_malloc(
              pixelCount,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  uint8_t* temporary =
      static_cast<uint8_t*>(
          heap_caps_malloc(
              pixelCount,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!mask ||
      !temporary) {
    free(mask);
    free(temporary);

    return nullptr;
  }

  // Python:
  // mask = ((sat < limit) & (val > threshold)) * 255
  for (int y = 0;
       y < roiHeight;
       ++y) {
    const uint16_t* row =
        frame +
        (roiY + y) *
            frameWidth +
        roiX;

    uint8_t* output =
        mask +
        y * roiWidth;

    for (int x = 0;
         x < roiWidth;
         ++x) {
      uint8_t saturation;
      uint8_t value;

      mechSVFromRgb565(
          row[x],
          saturation,
          value);

      output[x] =
          (saturation <
               saturationLimit &&
           value >
               threshold)
              ? 255
              : 0;
    }
  }

  // Python:
  // cv2.morphologyEx(mask, MORPH_CLOSE, ones((2,2)))
  //
  // 2x2 dilation, anchor=(1,1)
  for (int y = 0;
       y < roiHeight;
       ++y) {
    for (int x = 0;
         x < roiWidth;
         ++x) {
      uint8_t value = 0;

      for (int dy = -1;
           dy <= 0 &&
           value == 0;
           ++dy) {
        const int yy =
            y + dy;

        if (yy < 0 ||
            yy >= roiHeight) {
          continue;
        }

        for (int dx = -1;
             dx <= 0;
             ++dx) {
          const int xx =
              x + dx;

          if (xx < 0 ||
              xx >= roiWidth) {
            continue;
          }

          if (mask[
                  yy *
                      roiWidth +
                  xx]) {
            value =
                255;

            break;
          }
        }
      }

      temporary[
          y *
              roiWidth +
          x] =
          value;
    }
  }

  // 2x2 erosion.
  for (int y = 0;
       y < roiHeight;
       ++y) {
    for (int x = 0;
         x < roiWidth;
         ++x) {
      uint8_t value =
          255;

      for (int dy = -1;
           dy <= 0 &&
           value != 0;
           ++dy) {
        const int yy =
            y + dy;

