Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
        if (yy < 0 ||
            yy >= roiHeight) {
          continue;
        }

        for (int dx = -1;
             dx <= 0;
             ++dx) {
          const int xx =
              x + dx;

          if (xx < 0 ||
              xx >= roiWidth) {
            continue;
          }

          if (!temporary[
                  yy *
                      roiWidth +
                  xx]) {
            value =
                0;

            break;
          }
        }
      }

      mask[
          y *
              roiWidth +
          x] =
          value;
    }
  }

  free(temporary);

  return mask;
}

static void mechSortComponentsByX(
    MechanicalComponent* components,
    int count) {
  for (int i = 0;
       i < count - 1;
       ++i) {
    for (int j = i + 1;
         j < count;
         ++j) {
      if (components[j].x <
          components[i].x) {
        MechanicalComponent temporary =
            components[i];

        components[i] =
            components[j];

        components[j] =
            temporary;
      }
    }
  }
}

static int mechFindDigits(
    uint8_t* mask,
    int width,
    int height,
    MechanicalComponent output[
        MECH_MAX_COMPONENTS]) {
  if (!mask ||
      width <= 0 ||
      height <= 0) {
    return 0;
  }

  // Exact Python:
  // min_area = max(50, int(H*W*0.0005))
  const int minimumArea =
      max(
          50,
          static_cast<int>(
              static_cast<float>(
                  height) *
              static_cast<float>(
                  width) *
              0.0005f));

  int32_t* stack =
      static_cast<int32_t*>(
          heap_caps_malloc(
              sizeof(int32_t) *
                  MECH_FLOOD_STACK_CAP,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!stack) {
    return -1;
  }

  static const int8_t deltaX[8] = {
      -1, 0, 1,
      -1,    1,
      -1, 0, 1};

  static const int8_t deltaY[8] = {
      -1, -1, -1,
       0,      0,
       1,  1,  1};

  int outputCount = 0;
  bool overflowSeen = false;

  for (int startY = 0;
       startY < height;
       ++startY) {
    for (int startX = 0;
         startX < width;
         ++startX) {
      const int startIndex =
          startY *
              width +
          startX;

      if (mask[startIndex] !=
          255) {
        continue;
      }

      int stackTop = 0;

      stack[stackTop++] =
          startIndex;

      mask[startIndex] =
          128;

      int minimumX =
          startX;

      int maximumX =
          startX;

      int minimumY =
          startY;

      int maximumY =
          startY;

      int area = 0;
      bool overflow = false;

      while (stackTop > 0) {
        const int index =
            stack[--stackTop];

        const int x =
            index %
            width;

        const int y =
            index /
            width;

        area++;

        minimumX =
            min(
                minimumX,
                x);

        maximumX =
            max(
                maximumX,
                x);

        minimumY =
            min(
                minimumY,
                y);

        maximumY =
            max(
                maximumY,
                y);

        for (int neighbour = 0;
             neighbour < 8;
             ++neighbour) {
          const int nextX =
              x +
              deltaX[neighbour];

          const int nextY =
              y +
              deltaY[neighbour];

          if (nextX < 0 ||
              nextX >= width ||
              nextY < 0 ||
              nextY >= height) {
            continue;
          }

          const int nextIndex =
              nextY *
                  width +
              nextX;

          if (mask[nextIndex] !=
              255) {
            continue;
          }

          mask[nextIndex] =
              128;

          if (stackTop <
              MECH_FLOOD_STACK_CAP) {
            stack[stackTop++] =
                nextIndex;
          }

          else {
            overflow =
                true;
          }
        }
      }

      if (overflow) {
        overflowSeen =
            true;

        continue;
      }

      const int componentWidth =
          maximumX -
          minimumX +
          1;

      const int componentHeight =
          maximumY -
          minimumY +
          1;

      const float centreY =
          minimumY +
          componentHeight /
              2.0f;

      // Exact Python component filters.
      const bool accepted =
          componentHeight >=
              max(
                  20,
                  static_cast<int>(
                      height *
                      0.25f)) &&
          componentHeight <=
              static_cast<int>(
                  height *
                  0.85f) &&
          componentWidth >=
              5 &&
          componentWidth <=
              static_cast<int>(
                  width *
                  0.18f) &&
          area >=
              minimumArea &&
          centreY >
              height *
                  0.18f &&
          centreY <
              height *
                  0.82f;

      if (accepted &&
          outputCount <
              MECH_MAX_COMPONENTS) {
        output[outputCount++] = {
            minimumX,
            minimumY,
            componentWidth,
            componentHeight,
            area};
      }
    }
  }

  const size_t pixelCount =
      static_cast<size_t>(
          width) *
      height;

  for (size_t i = 0;
       i < pixelCount;
       ++i) {
    if (mask[i] ==
        128) {
      mask[i] =
          255;
    }
  }

  free(stack);

  if (overflowSeen &&
      outputCount == 0) {
    return -2;
  }

  mechSortComponentsByX(
      output,
      outputCount);

  return outputCount;
}

// Area-weighted sampling to match cv2.INTER_AREA much more closely than
// the old bilinear embedded approximation.
static uint8_t mechAreaResizeSample(
    const uint8_t* source,
    int sourceWidth,
    int sourceHeight,
    int destinationX,
    int destinationY,
    int destinationWidth,
    int destinationHeight) {
  const float x0 =
      static_cast<float>(
          destinationX) *
      sourceWidth /
      destinationWidth;

