Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
  const float x1 =
      static_cast<float>(
          destinationX + 1) *
      sourceWidth /
      destinationWidth;

  const float y0 =
      static_cast<float>(
          destinationY) *
      sourceHeight /
      destinationHeight;

  const float y1 =
      static_cast<float>(
          destinationY + 1) *
      sourceHeight /
      destinationHeight;

  const int sourceX0 =
      max(
          0,
          static_cast<int>(
              floorf(x0)));

  const int sourceX1 =
      min(
          sourceWidth - 1,
          static_cast<int>(
              ceilf(x1) - 1));

  const int sourceY0 =
      max(
          0,
          static_cast<int>(
              floorf(y0)));

  const int sourceY1 =
      min(
          sourceHeight - 1,
          static_cast<int>(
              ceilf(y1) - 1));

  float weightedSum =
      0.0f;

  float totalWeight =
      0.0f;

  for (int sourceY = sourceY0;
       sourceY <= sourceY1;
       ++sourceY) {
    const float weightY =
        max(
            0.0f,
            min(
                y1,
                static_cast<float>(
                    sourceY + 1)) -
            max(
                y0,
                static_cast<float>(
                    sourceY)));

    if (weightY <= 0.0f) {
      continue;
    }

    for (int sourceX = sourceX0;
         sourceX <= sourceX1;
         ++sourceX) {
      const float weightX =
          max(
              0.0f,
              min(
                  x1,
                  static_cast<float>(
                      sourceX + 1)) -
              max(
                  x0,
                  static_cast<float>(
                      sourceX)));

      if (weightX <= 0.0f) {
        continue;
      }

      const float weight =
          weightX *
          weightY;

      weightedSum +=
          source[
              sourceY *
                  sourceWidth +
              sourceX] *
          weight;

      totalWeight +=
          weight;
    }
  }

  if (totalWeight <= 0.0f) {
    return 0;
  }

  return static_cast<uint8_t>(
      roundf(
          weightedSum /
          totalWeight));
}

static bool mechNormalizeDigit(
    const uint8_t* mask,
    int maskWidth,
    int maskHeight,
    const MechanicalComponent& component,
    uint8_t output[
        MECH_INT8_TEMPLATE_PIXELS]) {
  memset(
      output,
      0,
      MECH_INT8_TEMPLATE_PIXELS);

  int left =
      component.x +
      component.w;

  int right =
      component.x - 1;

  int top =
      component.y +
      component.h;

  int bottom =
      component.y - 1;

  // Python tightens component to non-zero pixels.
  for (int y = component.y;
       y < component.y +
               component.h;
       ++y) {
    if (y < 0 ||
        y >= maskHeight) {
      continue;
    }

    for (int x = component.x;
         x < component.x +
                 component.w;
         ++x) {
      if (x < 0 ||
          x >= maskWidth) {
        continue;
      }

      if (mask[
              y *
                  maskWidth +
              x] >
          0) {
        left =
            min(
                left,
                x);

        right =
            max(
                right,
                x);

        top =
            min(
                top,
                y);

        bottom =
            max(
                bottom,
                y);
      }
    }
  }

  if (right < left ||
      bottom < top) {
    return false;
  }

  const int sourceWidth =
      right -
      left +
      1;

  const int sourceHeight =
      bottom -
      top +
      1;

  // Exact Python target:
  // scale = min(34/w, 58/h)
  const float scale =
      min(
          34.0f /
              max(
                  1,
                  sourceWidth),
          58.0f /
              max(
                  1,
                  sourceHeight));

  const int newWidth =
      max(
          1,
          static_cast<int>(
              roundf(
                  sourceWidth *
                  scale)));

  const int newHeight =
      max(
          1,
          static_cast<int>(
              roundf(
                  sourceHeight *
                  scale)));

  const int offsetX =
      (MECH_INT8_TEMPLATE_W -
       newWidth) /
      2;

  const int offsetY =
      (MECH_INT8_TEMPLATE_H -
       newHeight) /
      2;

  const size_t cropBytes =
      static_cast<size_t>(
          sourceWidth) *
      sourceHeight;

  uint8_t* crop =
      static_cast<uint8_t*>(
          heap_caps_malloc(
              cropBytes,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!crop) {
    return false;
  }

  for (int y = 0;
       y < sourceHeight;
       ++y) {
    memcpy(
        crop +
            y *
                sourceWidth,
        mask +
            (top + y) *
                maskWidth +
            left,
        sourceWidth);
  }

  for (int destinationY = 0;
       destinationY < newHeight;
       ++destinationY) {
    for (int destinationX = 0;
         destinationX < newWidth;
         ++destinationX) {
      output[
          (offsetY +
           destinationY) *
              MECH_INT8_TEMPLATE_W +
          (offsetX +
           destinationX)] =
          mechAreaResizeSample(
              crop,
              sourceWidth,
              sourceHeight,
              destinationX,
              destinationY,
              newWidth,
              newHeight);
    }
  }

  free(crop);

  return true;
}

// Exact Pearson correlation math, using the validated INT8 template values.
// No float 0..1 conversion is required because correlation is invariant to
// positive scaling.
static void mechTemplateStats(
    int templateIndex,
    int64_t& sumReference,
    int64_t& sumReferenceSquared) {
  sumReference = 0;
  sumReferenceSquared = 0;

  // Calculated from the user's exact Python-generated INT8 header.
  // This keeps mechanical_templates_int8.h completely untouched.
  for (int pixelIndex = 0;
       pixelIndex < MECH_INT8_TEMPLATE_PIXELS;
       ++pixelIndex) {
    const int32_t referenceValue =
        mechInt8TemplatePixel(
            templateIndex,
            pixelIndex);

    sumReference +=
        referenceValue;

