Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
    sumReferenceSquared +=
        static_cast<int64_t>(
            referenceValue) *
        referenceValue;
  }
}

static float mechCorrelationShifted(
    const uint8_t test[
        MECH_INT8_TEMPLATE_PIXELS],
    int templateIndex,
    int shiftX,
    int shiftY,
    int64_t sumReference,
    int64_t sumReferenceSquared) {
  constexpr int64_t N =
      MECH_INT8_TEMPLATE_PIXELS;

  int64_t sumTest = 0;
  int64_t sumTestSquared = 0;
  int64_t sumProduct = 0;

  for (int y = 0;
       y < MECH_INT8_TEMPLATE_H;
       ++y) {
    const int sourceY =
        y -
        shiftY;

    for (int x = 0;
         x < MECH_INT8_TEMPLATE_W;
         ++x) {
      const int sourceX =
          x -
          shiftX;

      int32_t testValue = 0;

      if (sourceX >= 0 &&
          sourceX < MECH_INT8_TEMPLATE_W &&
          sourceY >= 0 &&
          sourceY < MECH_INT8_TEMPLATE_H) {
        testValue =
            test[
                sourceY *
                    MECH_INT8_TEMPLATE_W +
                sourceX];
      }

      const int pixelIndex =
          y *
              MECH_INT8_TEMPLATE_W +
          x;

      const int32_t referenceValue =
          mechInt8TemplatePixel(
              templateIndex,
              pixelIndex);

      sumTest +=
          testValue;

      sumTestSquared +=
          static_cast<int64_t>(
              testValue) *
          testValue;

      sumProduct +=
          static_cast<int64_t>(
              testValue) *
          referenceValue;
    }
  }

  const int64_t numerator =
      N *
          sumProduct -
      sumTest *
          sumReference;

  const int64_t varianceTest =
      N *
          sumTestSquared -
      sumTest *
          sumTest;

  const int64_t varianceReference =
      N *
          sumReferenceSquared -
      sumReference *
          sumReference;

  if (varianceTest <= 0 ||
      varianceReference <= 0) {
    return -1.0f;
  }

  const double denominator =
      sqrt(
          static_cast<double>(
              varianceTest) *
          static_cast<double>(
              varianceReference));

  if (denominator < 1e-9) {
    return -1.0f;
  }

  return static_cast<float>(
      static_cast<double>(
          numerator) /
      denominator);
}

static float mechShiftedScore(
    const uint8_t test[
        MECH_INT8_TEMPLATE_PIXELS],
    int templateIndex) {
  float bestScore =
      -1.0f;

  // Compute template mean/variance statistics once, then reuse them
  // across all 25 shifts.
  int64_t sumReference = 0;
  int64_t sumReferenceSquared = 0;

  mechTemplateStats(
      templateIndex,
      sumReference,
      sumReferenceSquared);

  // Exact Python range(-2, 3).
  for (int shiftY = -2;
       shiftY <= 2;
       ++shiftY) {
    for (int shiftX = -2;
         shiftX <= 2;
         ++shiftX) {
      bestScore =
          max(
              bestScore,
              mechCorrelationShifted(
                  test,
                  templateIndex,
                  shiftX,
                  shiftY,
                  sumReference,
                  sumReferenceSquared));
    }
  }

  return bestScore;
}

static int mechCountHoles(
    const uint8_t image[
        MECH_INT8_TEMPLATE_PIXELS]) {
  uint8_t* inverted =
      static_cast<uint8_t*>(
          heap_caps_malloc(
              MECH_INT8_TEMPLATE_PIXELS,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  int32_t* stack =
      static_cast<int32_t*>(
          heap_caps_malloc(
              sizeof(int32_t) *
                  MECH_INT8_TEMPLATE_PIXELS,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!inverted ||
      !stack) {
    free(inverted);
    free(stack);

    return 0;
  }

  // Exact Python:
  // binary = img > 127
  // inverted = 1 - binary
  for (int i = 0;
       i < MECH_INT8_TEMPLATE_PIXELS;
       ++i) {
    inverted[i] =
        (image[i] >
         127)
            ? 0
            : 1;
  }

  static const int8_t deltaX[8] = {
      -1, 0, 1,
      -1,    1,
      -1, 0, 1};

  static const int8_t deltaY[8] = {
      -1, -1, -1,
       0,      0,
       1,  1,  1};

  const int minimumArea =
      max(
          5,
          static_cast<int>(
              MECH_INT8_TEMPLATE_H *
              MECH_INT8_TEMPLATE_W *
              0.01f));

  int holes = 0;

  for (int startY = 0;
       startY < MECH_INT8_TEMPLATE_H;
       ++startY) {
    for (int startX = 0;
         startX < MECH_INT8_TEMPLATE_W;
         ++startX) {
      const int startIndex =
          startY *
              MECH_INT8_TEMPLATE_W +
          startX;

      if (inverted[startIndex] !=
          1) {
        continue;
      }

      int stackTop = 0;

      stack[stackTop++] =
          startIndex;

      inverted[startIndex] =
          2;

      int minimumX =
          startX;

      int maximumX =
          startX;

      int minimumY =
          startY;

      int maximumY =
          startY;

      int area = 0;

      while (stackTop > 0) {
        const int index =
            stack[--stackTop];

        const int x =
            index %
            MECH_INT8_TEMPLATE_W;

        const int y =
            index /
            MECH_INT8_TEMPLATE_W;

        area++;

        minimumX =
            min(
                minimumX,
                x);

        maximumX =
            max(
                maximumX,
                x);

        minimumY =
            min(
                minimumY,
                y);

        maximumY =
            max(
                maximumY,
                y);

        for (int neighbour = 0;
             neighbour < 8;
             ++neighbour) {
          const int nextX =
              x +
              deltaX[neighbour];

          const int nextY =
              y +
              deltaY[neighbour];

          if (nextX < 0 ||
              nextX >=
                  MECH_INT8_TEMPLATE_W ||
              nextY < 0 ||
              nextY >=
                  MECH_INT8_TEMPLATE_H) {
            continue;
          }

          const int nextIndex =
              nextY *
                  MECH_INT8_TEMPLATE_W +
              nextX;

          if (inverted[nextIndex] ==
              1) {
            inverted[nextIndex] =
                2;

            stack[stackTop++] =
                nextIndex;
          }
        }
      }

      const bool touchesEdge =
          minimumX <= 0 ||
          minimumY <= 0 ||
          maximumX >=
              MECH_INT8_TEMPLATE_W - 1 ||
          maximumY >=
              MECH_INT8_TEMPLATE_H - 1;

      if (!touchesEdge &&
          area >=
              minimumArea) {
        holes++;
      }
    }
  }

  free(inverted);
  free(stack);

