Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
  return holes;
}

static void mechClassifyDigit(
    const uint8_t normalized[
        MECH_INT8_TEMPLATE_PIXELS],
    char& bestDigit,
    float& bestScore,
    char& secondDigit,
    float& secondScore) {
  float scores[10];

  for (int digit = 0;
       digit < 10;
       ++digit) {
    scores[digit] =
        -1.0f;
  }

  // Python:
  // for digit 0..9:
  //   max shifted_score across all templates of that label
  for (int templateIndex = 0;
       templateIndex <
           MECH_INT8_TEMPLATE_COUNT;
       ++templateIndex) {
    const char label =
        mechInt8TemplateLabel(
            templateIndex);

    if (label < '0' ||
        label > '9') {
      continue;
    }

    const int digit =
        label -
        '0';

    const float score =
        mechShiftedScore(
            normalized,
            templateIndex);

    if (score >
        scores[digit]) {
      scores[digit] =
          score;
    }
  }

  int best =
      0;

  for (int digit = 1;
       digit < 10;
       ++digit) {
    if (scores[digit] >
        scores[best]) {
      best =
          digit;
    }
  }

  bestDigit =
      static_cast<char>(
          '0' +
          best);

  bestScore =
      scores[best];

  // Exact Python targeted 5-vs-6 correction.
  if (bestDigit == '5' ||
      bestDigit == '6') {
    const int holes =
        mechCountHoles(
            normalized);

    const float score5 =
        scores[5];

    const float score6 =
        scores[6];

    if (holes == 0 &&
        score5 >=
            score6 -
            0.08f) {
      bestDigit =
          '5';

      bestScore =
          score5;
    }

    else if (
        holes >= 1 &&
        score6 >=
            score5 -
            0.08f) {
      bestDigit =
          '6';

      bestScore =
          score6;
    }
  }

  const int chosenDigit =
      bestDigit -
      '0';

  int second =
      -1;

  for (int digit = 0;
       digit < 10;
       ++digit) {
    if (digit ==
        chosenDigit) {
      continue;
    }

    if (second < 0 ||
        scores[digit] >
            scores[second]) {
      second =
          digit;
    }
  }

  if (second < 0) {
    second =
        chosenDigit;
  }

  secondDigit =
      static_cast<char>(
          '0' +
          second);

  secondScore =
      scores[second];
}

static bool mechRunSingleMask(
    const uint16_t* frame,
    int frameWidth,
    int frameHeight,
    int roiX,
    int roiY,
    int roiWidth,
    int roiHeight,
    int before,
    int after,
    int saturationLimit,
    MechanicalOcrResult* out) {
  if (!out) {
    return false;
  }

  memset(
      out,
      0,
      sizeof(*out));

  const int expectedDigits =
      before +
      after;

  out->expectedDigits =
      expectedDigits;

  out->saturationLimitUsed =
      saturationLimit;

  uint8_t* mask =
      mechMakeMask(
          frame,
          frameWidth,
          frameHeight,
          roiX,
          roiY,
          roiWidth,
          roiHeight,
          saturationLimit);

  if (!mask) {
    mechSetError(
        out,
        "Could not allocate/build mechanical digit mask");

    return false;
  }

  MechanicalComponent components[
      MECH_MAX_COMPONENTS];

  const int componentCount =
      mechFindDigits(
          mask,
          roiWidth,
          roiHeight,
          components);

  if (componentCount == -1) {
    free(mask);

    mechSetError(
        out,
        "PSRAM allocation failed during connected components");

    return false;
  }

  if (componentCount == -2) {
    free(mask);

    mechSetError(
        out,
        "Connected component exceeded flood buffer");

    return false;
  }

  if (componentCount <= 0) {
    free(mask);

    mechSetError(
        out,
        "No roller digits detected");

    return false;
  }

  if (componentCount >
      MECH_MAX_DIGITS) {
    free(mask);

    mechSetError(
        out,
        "More than 16 digit-like components detected");

    return false;
  }

  out->detectedDigits =
      componentCount;

  uint8_t* normalized =
      static_cast<uint8_t*>(
          heap_caps_malloc(
              MECH_INT8_TEMPLATE_PIXELS,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!normalized) {
    free(mask);

    mechSetError(
        out,
        "PSRAM allocation failed for normalized digit");

    return false;
  }

  float totalScore =
      0.0f;

  float totalMargin =
      0.0f;

  for (int i = 0;
       i < componentCount;
       ++i) {
    if (!mechNormalizeDigit(
            mask,
            roiWidth,
            roiHeight,
            components[i],
            normalized)) {
      free(normalized);
      free(mask);

      mechSetError(
          out,
          "Digit normalization failed");

      return false;
    }

    char digit;
    float score;
    char secondDigit;
    float secondScore;

    mechClassifyDigit(
        normalized,
        digit,
        score,
        secondDigit,
        secondScore);

    out->digits[i].digit =
        digit;

    out->digits[i].score =
        score;

    out->digits[i].secondDigit =
        secondDigit;

    out->digits[i].secondScore =
        secondScore;

    out->digits[i].component =
        components[i];

    out->raw[i] =
        digit;

    totalScore +=
        score;

    totalMargin +=
        max(
            0.0f,
            score -
                secondScore);
  }

  free(normalized);
  free(mask);

  out->raw[
      componentCount] =
      '\0';

  out->averageScore =
      totalScore /
      componentCount;

  out->averageMargin =
      totalMargin /
      componentCount;

  if (after > 0 &&
      componentCount >
          before) {
    int outputPosition = 0;

    for (int i = 0;
         i < componentCount &&
         outputPosition <
             static_cast<int>(
                 sizeof(
                     out->reading)) -
                 2;
         ++i) {
      if (i ==
          before) {
        out->reading[
            outputPosition++] =
            '.';
      }

      out->reading[
          outputPosition++] =
          out->raw[i];
    }

    out->reading[
        outputPosition] =
        '\0';
  }

  else {
    strncpy(
        out->reading,
        out->raw,
        sizeof(
            out->reading) -
            1);

    out->reading[
        sizeof(
            out->reading) -
        1] =
        '\0';
  }

  out->success =
      true;

