Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
  out->error[0] =
      '\0';

  return true;
}

static float mechResultEvidence(
    const MechanicalOcrResult& result) {
  if (!result.success ||
      result.detectedDigits <= 0) {
    return -999.0f;
  }

  return
      result.averageScore +
      0.65f *
          result.averageMargin;
}

// Python S<110 is always tried first.
// S<125 is only an embedded rescue for RGB565 color quantization.
static bool mechanicalReadRgb565(
    const uint16_t* frame,
    int frameWidth,
    int frameHeight,
    int roiX,
    int roiY,
    int roiWidth,
    int roiHeight,
    int before,
    int after,
    MechanicalOcrResult* out) {
  if (!out) {
    return false;
  }

  memset(
      out,
      0,
      sizeof(*out));

  const int expectedDigits =
      before +
      after;

  if (!frame) {
    mechSetError(
        out,
        "No decoded camera image");

    return false;
  }

  if (before < 0 ||
      after < 0 ||
      expectedDigits <= 0 ||
      expectedDigits >
          MECH_MAX_DIGITS) {
    mechSetError(
        out,
        "Invalid BEFORE/AFTER digit layout");

    return false;
  }

  MechanicalOcrResult pythonMask = {};
  MechanicalOcrResult rgb565Rescue = {};

  const bool pythonOk =
      mechRunSingleMask(
          frame,
          frameWidth,
          frameHeight,
          roiX,
          roiY,
          roiWidth,
          roiHeight,
          before,
          after,
          110,
          &pythonMask);

  // If baseline has exact count and strong evidence, keep the Python path.
  const bool pythonStrong =
      pythonOk &&
      pythonMask.detectedDigits ==
          expectedDigits &&
      pythonMask.averageScore >=
          0.78f &&
      pythonMask.averageMargin >=
          0.10f;

  if (pythonStrong) {
    *out =
        pythonMask;

    out->rgb565RescueUsed =
        false;

    return true;
  }

  const bool rescueOk =
      mechRunSingleMask(
          frame,
          frameWidth,
          frameHeight,
          roiX,
          roiY,
          roiWidth,
          roiHeight,
          before,
          after,
          125,
          &rgb565Rescue);

  if (!pythonOk &&
      !rescueOk) {
    mechSetError(
        out,
        "Mechanical OCR failed at both Python and RGB565-safe masks");

    return false;
  }

  if (!pythonOk) {
    *out =
        rgb565Rescue;

    out->rgb565RescueUsed =
        true;

    return true;
  }

  if (!rescueOk) {
    *out =
        pythonMask;

    out->rgb565RescueUsed =
        false;

    return true;
  }

  const bool pythonExact =
      pythonMask.detectedDigits ==
      expectedDigits;

  const bool rescueExact =
      rgb565Rescue.detectedDigits ==
      expectedDigits;

  // Exact expected count wins.
  if (pythonExact &&
      !rescueExact) {
    *out =
        pythonMask;

    out->rgb565RescueUsed =
        false;

    return true;
  }

  if (rescueExact &&
      !pythonExact) {
    *out =
        rgb565Rescue;

    out->rgb565RescueUsed =
        true;

    return true;
  }

  // If both produced the exact same reading, keep Python baseline.
  if (pythonExact &&
      rescueExact &&
      strcmp(
          pythonMask.raw,
          rgb565Rescue.raw) ==
          0) {
    *out =
        pythonMask;

    out->rgb565RescueUsed =
        false;

    return true;
  }

  // Same digit count but disagreement:
  // choose stronger template score+margin evidence.
  if (pythonMask.detectedDigits ==
      rgb565Rescue.detectedDigits) {
    const float pythonEvidence =
        mechResultEvidence(
            pythonMask);

    const float rescueEvidence =
        mechResultEvidence(
            rgb565Rescue);

    if (rescueEvidence >
        pythonEvidence +
            0.015f) {
      *out =
          rgb565Rescue;

      out->rgb565RescueUsed =
          true;
    }

    else {
      *out =
          pythonMask;

      out->rgb565RescueUsed =
          false;
    }

    return true;
  }

  // Otherwise choose the count closer to BEFORE+AFTER.
  const int pythonDistance =
      abs(
          pythonMask.detectedDigits -
          expectedDigits);

  const int rescueDistance =
      abs(
          rgb565Rescue.detectedDigits -
          expectedDigits);

  if (rescueDistance <
      pythonDistance) {
    *out =
        rgb565Rescue;

    out->rgb565RescueUsed =
        true;
  }

  else {
    *out =
        pythonMask;

    out->rgb565RescueUsed =
        false;
  }

  return true;
}

static const char INDEX_HTML[] PROGMEM = R"HTML(
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no">
<title>MachineSens Mechanical Meter Setup</title>

<style>
:root{
  --bg:#0d1117;
  --panel:#161b22;
  --panel2:#0d1117;
  --border:#30363d;
  --text:#f0f6fc;
  --muted:#8b949e;
  --green:#238636;
  --green2:#2ea043;
  --blue:#1f6feb;
  --orange:#d29922;
  --red:#da3633;
  --gray:#30363d;
  --accent:#58a6ff;
}

*{box-sizing:border-box}

body{
  margin:0;
  background:var(--bg);
  color:var(--text);
  font-family:Arial,sans-serif;
}

header{
  padding:14px 18px;
  background:var(--panel);
  border-bottom:1px solid var(--border);
  position:sticky;
  top:0;
  z-index:20;
}

h1{
  margin:0;
  font-size:20px;
}

.subtitle{
  color:var(--muted);
  font-size:12px;
  margin-top:5px;
}

.layout{
  display:grid;
  grid-template-columns:minmax(350px,1.15fr) minmax(330px,.85fr);
  gap:14px;
  max-width:1500px;
  margin:auto;
  padding:14px;
}

.panel{
  background:var(--panel);
  border:1px solid var(--border);
  border-radius:12px;
  overflow:hidden;
}

.panel-title{
  padding:12px 14px;
  border-bottom:1px solid var(--border);
  font-weight:bold;
}

.preview-wrap{
  padding:12px;
}

#liveStage,#captureStage{
  position:relative;
  width:100%;
  background:#000;
  border-radius:8px;
  overflow:hidden;
}

#liveStage{
  min-height:220px;
  display:flex;
  align-items:center;
  justify-content:center;
}

#captureStage{
  display:block;
  min-height:0;
}

#stream,#captured{
  display:block;
  width:100%;
  height:auto;
  max-height:72vh;
  object-fit:contain;
}

#cropCanvas{
  position:absolute;
  left:0;
  top:0;
  z-index:5;
  touch-action:none;
  cursor:crosshair;
  pointer-events:auto;
}

.hidden{display:none!important}

.capture-actions{
  display:flex;
  flex-wrap:wrap;
  gap:8px;
  margin-top:12px;
}

