Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
button{
  border:0;
  border-radius:7px;
  padding:11px 14px;
  font-weight:bold;
  cursor:pointer;
  font-size:13px;
  color:#fff;
}

button:disabled{
  opacity:.55;
  cursor:not-allowed;
}

.primary{background:var(--green)}
.primary:hover{background:var(--green2)}
.blue{background:var(--blue)}
.orange{background:var(--orange)}
.gray{background:var(--gray)}
.red{background:var(--red)}

.section{
  border:1px solid var(--border);
  border-radius:10px;
  padding:12px;
  background:var(--panel2);
}

.section h3{
  margin:0 0 10px;
  font-size:14px;
}

select{
  width:100%;
  background:var(--panel);
  color:var(--text);
  border:1px solid var(--border);
  border-radius:6px;
  padding:8px;
}

.reading-label{
  color:var(--muted);
  font-size:12px;
  margin-bottom:5px;
}

#captureStatus{
  margin:12px 0 0;
  padding:10px 12px;
  border:1px solid var(--border);
  background:var(--panel2);
  border-radius:8px;
  color:#c9d1d9;
  font-size:13px;
}

#readingBox{
  margin-top:12px;
  padding:14px;
  border:1px solid var(--border);
  border-radius:10px;
  background:var(--panel2);
}

.reading-value{
  font-size:36px;
  line-height:1.15;
  font-weight:800;
  letter-spacing:1px;
  color:#3fb950;
  word-break:break-word;
}

.info{
  margin-top:8px;
  color:var(--muted);
  font-size:12px;
  line-height:1.45;
}


.controls{
  padding:12px;
}

.control{
  margin-bottom:14px;
}

.control:last-child{
  margin-bottom:0;
}

.control-header{
  display:flex;
  justify-content:space-between;
  gap:10px;
  margin-bottom:6px;
  font-size:13px;
}

.value{
  color:var(--accent);
  font-weight:bold;
}

input[type="range"]{
  width:100%;
  accent-color:#2ea043;
  cursor:pointer;
  height:24px;
}

input[type="range"]::-webkit-slider-runnable-track{
  height:6px;
  border-radius:999px;
  background:#30363d;
}

input[type="range"]::-webkit-slider-thumb{
  margin-top:-5px;
}

select{
  width:100%;
  background:#161b22;
  color:#f0f6fc;
  border:1px solid #30363d;
  border-radius:6px;
  padding:8px;
}

.switch-row{
  display:flex;
  justify-content:space-between;
  align-items:center;
  gap:15px;
  margin:10px 0;
  font-size:13px;
}

.switch-row input{
  width:22px;
  height:22px;
}

.details{
  margin-top:12px;
  padding:12px;
  border:1px solid var(--border);
  border-radius:10px;
  background:#0b0f14;
  color:#a5d6ff;
  white-space:pre-wrap;
  font-family:Consolas,monospace;
  font-size:12px;
  max-height:340px;
  overflow:auto;
}

.status-grid{
  display:grid;
  grid-template-columns:1fr 1fr;
  gap:8px;
  margin-top:12px;
}

.status-card{
  border:1px solid var(--border);
  background:var(--panel2);
  border-radius:8px;
  padding:10px;
}

.status-card .k{
  color:var(--muted);
  font-size:11px;
}

.status-card .v{
  margin-top:4px;
  font-weight:bold;
  font-size:13px;
}

#message{
  position:fixed;
  right:16px;
  bottom:16px;
  z-index:100;
  display:none;
  max-width:360px;
  padding:12px 14px;
  border-radius:8px;
  background:var(--green);
  color:#fff;
  box-shadow:0 5px 25px #000;
}

@media(max-width:900px){
  .layout{grid-template-columns:1fr}
  header{position:relative}
  .status-grid{grid-template-columns:1fr}
}
</style>
</head>

<body>

<header>
  <h1>MachineSens Mechanical Meter Camera</h1>
  <div class="subtitle">
    VGA Live → XGA 1024×768 Q3 Still → Frozen INT8 Mechanical OCR
  </div>
</header>

<div class="layout">

  <!-- LEFT -->
  <div class="panel">
    <div class="panel-title">Camera & Roller Meter Crop</div>

    <div class="preview-wrap">

      <div id="liveMode">
        <div id="liveStage">
          <img id="stream" alt="Live camera">
        </div>

        <div class="capture-actions">
          <button class="primary" onclick="takePhoto()">📷 TAKE PHOTO</button>
          <button class="gray" onclick="restartStream(true)">🔄 Restart Livecam</button>
        </div>
      </div>

      <div id="captureMode" class="hidden">
        <div id="captureStage">
          <img id="captured" alt="Captured photo">
          <canvas id="cropCanvas"></canvas>
        </div>

        <div class="section" style="margin-top:12px">
          <h3>Meter Format</h3>

          <div style="display:grid;grid-template-columns:1fr 1fr;gap:10px">
            <div>
              <div class="reading-label">Digits BEFORE decimal</div>
              <select id="digitsBefore" onchange="updateExpectedDigits()">
                <option>0</option><option>1</option><option>2</option>
                <option>3</option><option>4</option><option>5</option>
                <option selected>6</option><option>7</option><option>8</option>
                <option>9</option><option>10</option><option>11</option>
                <option>12</option><option>13</option><option>14</option>
                <option>15</option><option>16</option>
              </select>
            </div>

            <div>
              <div class="reading-label">Digits AFTER decimal</div>
              <select id="digitsAfter" onchange="updateExpectedDigits()">
                <option selected>1</option><option>0</option><option>2</option>
                <option>3</option><option>4</option>
              </select>
            </div>
          </div>

          <div id="expectedDigits" class="info">
            Expected numeric digits: 7
          </div>

          <div class="info">
            Crop ONLY the roller-number window. The decimal is inserted from this configuration.
          </div>
        </div>

        <div class="capture-actions">
          <button class="primary" onclick="confirmCrop()">✅ READ MECHANICAL</button>
          <button class="blue" onclick="recrop()">✂ RE-CROP</button>
          <button class="orange" onclick="retakePhoto()">📷 RETAKE PHOTO</button>
          <button class="gray" onclick="backToLive()">🎥 BACK TO LIVE</button>
        </div>
      </div>

      <div id="captureStatus">Connecting to live camera...</div>

      <div id="readingBox">
        <div class="reading-label">Mechanical meter result</div>
        <div id="readingValue" class="reading-value">—</div>
        <div id="readingInfo" class="info">
          Take a photo, crop the roller digits, choose the digit format, then press READ MECHANICAL.
        </div>
      </div>

      <div id="resultDetails" class="details">No OCR result yet.</div>
    </div>
  </div>

  <!-- RIGHT -->
  <div class="panel">
    <div class="panel-title">Camera Controls</div>

    <div class="controls">

      <div class="section">
        <h3>Image</h3>

        <div class="control">
          <div class="control-header">
            <span>Brightness</span>
            <span id="brightnessValue" class="value">0</span>
          </div>
          <input id="brightness" type="range" min="-2" max="2" step="1" value="0"
                 oninput="rangeChanged('brightness',this.value)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Contrast</span>
            <span id="contrastValue" class="value">0</span>
          </div>
          <input id="contrast" type="range" min="-2" max="2" step="1" value="0"
                 oninput="rangeChanged('contrast',this.value)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Saturation</span>
            <span id="saturationValue" class="value">0</span>
          </div>
          <input id="saturation" type="range" min="-2" max="2" step="1" value="0"
                 oninput="rangeChanged('saturation',this.value)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Sharpness</span>
            <span id="sharpnessValue" class="value">0</span>
          </div>
          <input id="sharpness" type="range" min="-2" max="2" step="1" value="0"
                 oninput="rangeChanged('sharpness',this.value)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Denoise</span>
            <span id="denoiseValue" class="value">0</span>
          </div>
          <input id="denoise" type="range" min="0" max="8" step="1" value="0"
                 oninput="rangeChanged('denoise',this.value)">
        </div>

        <div class="control">
          <div class="control-header"><span>Special Effect</span></div>
          <select id="specialEffect" onchange="selectChanged('specialEffect',this.value)">
            <option value="0" selected>None</option>
            <option value="1">Negative</option>
            <option value="2">Grayscale</option>
            <option value="3">Red Tint</option>
            <option value="4">Green Tint</option>
            <option value="5">Blue Tint</option>
            <option value="6">Sepia</option>
          </select>
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>White Balance</h3>

        <div class="switch-row">
          <span>White Balance</span>
          <input id="whiteBalance" type="checkbox" checked
                 onchange="toggleChanged('whiteBalance',this.checked)">
        </div>

        <div class="switch-row">
          <span>AWB Gain</span>
          <input id="awbGain" type="checkbox" checked
                 onchange="toggleChanged('awbGain',this.checked)">
        </div>

        <div class="control">
          <div class="control-header"><span>WB Mode</span></div>
          <select id="wbMode" onchange="selectChanged('wbMode',this.value)">
            <option value="0" selected>Auto</option>
            <option value="1">Sunny</option>
            <option value="2">Cloudy</option>
            <option value="3">Office</option>
            <option value="4">Home</option>
          </select>
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>Exposure</h3>

        <div class="switch-row">
          <span>Automatic Exposure Control</span>
          <input id="exposureControl" type="checkbox" checked
                 onchange="toggleChanged('exposureControl',this.checked)">
        </div>

        <div class="switch-row">
          <span>AEC DSP Mode</span>
          <input id="aec2" type="checkbox"
                 onchange="toggleChanged('aec2',this.checked)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Auto Exposure Level</span>
            <span id="aeLevelValue" class="value">0</span>
          </div>
          <input id="aeLevel" type="range" min="-2" max="2" step="1" value="0"
                 oninput="rangeChanged('aeLevel',this.value)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Manual Exposure</span>
            <span id="aecValueValue" class="value">300</span>
          </div>
          <input id="aecValue" type="range" min="0" max="1200" step="10" value="300"
                 oninput="rangeChanged('aecValue',this.value)">
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>Gain</h3>

        <div class="switch-row">
          <span>Automatic Gain Control</span>
          <input id="gainControl" type="checkbox" checked
                 onchange="toggleChanged('gainControl',this.checked)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Manual Gain</span>
            <span id="agcGainValue" class="value">0</span>
          </div>
          <input id="agcGain" type="range" min="0" max="30" step="1" value="0"
                 oninput="rangeChanged('agcGain',this.value)">
        </div>

        <div class="control">
          <div class="control-header"><span>Gain Ceiling</span></div>
          <select id="gainCeiling" onchange="selectChanged('gainCeiling',this.value)">
            <option value="0">2×</option>
            <option value="1">4×</option>
            <option value="2" selected>8×</option>
            <option value="3">16×</option>
            <option value="4">32×</option>
            <option value="5">64×</option>
            <option value="6">128×</option>
          </select>
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>Image Corrections</h3>

        <div class="switch-row">
          <span>Black Pixel Correction</span>
          <input id="blackPixelCorrection" type="checkbox" checked
                 onchange="toggleChanged('blackPixelCorrection',this.checked)">
        </div>

        <div class="switch-row">
          <span>White Pixel Correction</span>
          <input id="whitePixelCorrection" type="checkbox" checked
                 onchange="toggleChanged('whitePixelCorrection',this.checked)">
        </div>

        <div class="switch-row">
          <span>Raw Gamma</span>
          <input id="rawGamma" type="checkbox" checked
                 onchange="toggleChanged('rawGamma',this.checked)">
        </div>

        <div class="switch-row">
          <span>Lens Correction</span>
          <input id="lensCorrection" type="checkbox" checked
                 onchange="toggleChanged('lensCorrection',this.checked)">
        </div>

        <div class="switch-row">
          <span>Downsize</span>
          <input id="downsize" type="checkbox" checked
                 onchange="toggleChanged('downsize',this.checked)">
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>Orientation</h3>

        <div class="switch-row">
          <span>Horizontal Mirror</span>
          <input id="horizontalMirror" type="checkbox"
                 onchange="toggleChanged('horizontalMirror',this.checked)">
        </div>

        <div class="switch-row">
          <span>Vertical Flip</span>
          <input id="verticalFlip" type="checkbox"
                 onchange="toggleChanged('verticalFlip',this.checked)">
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>Flash LED</h3>

        <div class="switch-row">
          <span>Use Flash for Still Photo</span>
          <input id="flashEnabled" type="checkbox"
                 onchange="toggleChanged('flashEnabled',this.checked)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>LED Intensity</span>
            <span id="flashBrightnessValue" class="value">80</span>
          </div>
          <input id="flashBrightness" type="range" min="0" max="255" step="1" value="80"
                 oninput="rangeChanged('flashBrightness',this.value)">
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>Still Capture</h3>

        <div class="control">
          <div class="control-header">
            <span>Capture Warm-up (ms)</span>
            <span id="captureWarmupMsValue" class="value">700</span>
          </div>
          <input id="captureWarmupMs" type="range" min="0" max="3000" step="50" value="700"
                 oninput="rangeChanged('captureWarmupMs',this.value)">
        </div>

        <div class="control">
          <div class="control-header">
            <span>Frames to Discard</span>
            <span id="framesToDiscardValue" class="value">4</span>
          </div>
          <input id="framesToDiscard" type="range" min="0" max="5" step="1" value="4"
                 oninput="rangeChanged('framesToDiscard',this.value)">
        </div>

        <div class="info">
          For stable bright still photos, firmware uses at least 900 ms warm-up, 5 discarded XGA transition frames, and one automatic brighter retry if the actual still is dark.
        </div>
      </div>

      <div class="section" style="margin-top:12px">
        <h3>ESP32-CAM Status</h3>

        <div class="status-grid">
          <div class="status-card">
            <div class="k">Wi-Fi</div>
            <div class="v">Mechanical_Meter_Test</div>
          </div>

