Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
          <div class="status-card">
            <div class="k">IP</div>
            <div class="v">192.168.4.1</div>
          </div>

          <div class="status-card">
            <div class="k">Live</div>
            <div class="v">640 × 480</div>
          </div>

          <div class="status-card">
            <div class="k">OCR photo</div>
            <div class="v">1024 × 768</div>
          </div>
        </div>
      </div>

      <div class="capture-actions">
        <button class="gray" onclick="resetCameraDefaults()">↩ RESET CAMERA DEFAULTS</button>
      </div>

    </div>
  </div>
</div>

<div id="message"></div>

<script>
const stream = document.getElementById('stream');
const captured = document.getElementById('captured');
const canvas = document.getElementById('cropCanvas');
const ctx = canvas.getContext('2d');

const liveMode = document.getElementById('liveMode');
const captureMode = document.getElementById('captureMode');
const captureStatus = document.getElementById('captureStatus');

const streamUrl = `http://${location.hostname}:81/stream`;

let cropRect = null;
let dragging = false;
let startX = 0;
let startY = 0;
let capturedObjectUrl = null;
let streamRetryTimer = null;
let streamGeneration = 0;

function sleepMs(ms){
  return new Promise(resolve=>setTimeout(resolve,ms));
}

function showMessage(text,bad=false){
  const box=document.getElementById('message');
  box.textContent=text;
  box.style.background=bad?'#da3633':'#238636';
  box.style.display='block';

  setTimeout(()=>{
    box.style.display='none';
  },2600);
}

function liveVisible(){
  return !liveMode.classList.contains('hidden');
}

async function restartStream(manual=false){
  const generation=++streamGeneration;

  if(streamRetryTimer){
    clearTimeout(streamRetryTimer);
    streamRetryTimer=null;
  }

  stream.onerror=null;
  stream.src='';

  await sleepMs(manual?260:180);

  if(generation!==streamGeneration || !liveVisible()){
    return;
  }

  stream.onerror=()=>{
    if(!liveVisible() || generation!==streamGeneration){
      return;
    }

    captureStatus.textContent='Live camera dropped. Reconnecting...';

    streamRetryTimer=setTimeout(()=>{
      restartStream(false);
    },1300);
  };

  stream.src=streamUrl+'?t='+Date.now();
  captureStatus.textContent='Stable VGA live camera ready.';
}

function stopStream(){
  ++streamGeneration;

  if(streamRetryTimer){
    clearTimeout(streamRetryTimer);
    streamRetryTimer=null;
  }

  stream.onerror=null;
  stream.src='';
}

function clearCropCanvas(){
  ctx.clearRect(0,0,canvas.width,canvas.height);
}

function resizeCropCanvas(){
  const rect=captured.getBoundingClientRect();

  // captureMode must be visible before this runs.
  if(rect.width<2 || rect.height<2){
    requestAnimationFrame(resizeCropCanvas);
    return;
  }

  canvas.width=Math.max(1,Math.round(rect.width));
  canvas.height=Math.max(1,Math.round(rect.height));

  canvas.style.width=rect.width+'px';
  canvas.style.height=rect.height+'px';

  drawCrop();
}

function pointerPosition(event){
  const bounds=canvas.getBoundingClientRect();

  return{
    x:(event.clientX-bounds.left)*(canvas.width/bounds.width),
    y:(event.clientY-bounds.top)*(canvas.height/bounds.height)
  };
}

function drawCrop(){
  clearCropCanvas();

  if(!cropRect){
    return;
  }

  ctx.fillStyle='rgba(0,255,85,.10)';
  ctx.fillRect(cropRect.x,cropRect.y,cropRect.w,cropRect.h);

  ctx.strokeStyle='#00ff55';
  ctx.lineWidth=3;
  ctx.strokeRect(cropRect.x,cropRect.y,cropRect.w,cropRect.h);

  ctx.fillStyle='#00ff55';
  ctx.font='bold 14px Arial';
  ctx.fillText(
    'ROLLER CROP',
    cropRect.x+5,
    Math.max(17,cropRect.y-5)
  );
}

canvas.addEventListener('pointerdown',event=>{
  event.preventDefault();

  try{
    canvas.setPointerCapture(event.pointerId);
  }catch(e){}

  const p=pointerPosition(event);

  startX=p.x;
  startY=p.y;
  dragging=true;

  cropRect={
    x:p.x,
    y:p.y,
    w:0,
    h:0
  };

  drawCrop();
});

canvas.addEventListener('pointermove',event=>{
  if(!dragging){
    return;
  }

  event.preventDefault();

  const p=pointerPosition(event);

  cropRect={
    x:Math.min(startX,p.x),
    y:Math.min(startY,p.y),
    w:Math.abs(p.x-startX),
    h:Math.abs(p.y-startY)
  };

  drawCrop();
});

function finishCrop(event){
  if(!dragging){
    return;
  }

  event.preventDefault();
  dragging=false;

  try{
    canvas.releasePointerCapture(event.pointerId);
  }catch(e){}

  if(!cropRect || cropRect.w<12 || cropRect.h<12){
    cropRect=null;
    clearCropCanvas();
    captureStatus.textContent='Crop too small. Drag again.';
    return;
  }

  captureStatus.textContent=
    'Crop selected. Press READ MECHANICAL, re-crop, or retake.';
}

canvas.addEventListener('pointerup',finishCrop);
canvas.addEventListener('pointercancel',finishCrop);

window.addEventListener('resize',()=>{
  if(!captureMode.classList.contains('hidden')){
    resizeCropCanvas();
  }
});

function updateExpectedDigits(){
  const before=parseInt(document.getElementById('digitsBefore').value||'0');
  const after=parseInt(document.getElementById('digitsAfter').value||'0');

  document.getElementById('expectedDigits').textContent=
    `Expected numeric digits: ${before+after}`;
}

async function takePhoto(){
  captureStatus.textContent='Taking high-quality XGA photo...';
  stopStream();

  await sleepMs(450);

  try{
    const response=await fetch('/capture?t='+Date.now(),{cache:'no-store'});

    if(!response.ok){
      let message='Capture failed';

      try{
        const data=await response.json();
        message=data.message||message;
      }catch(e){}

      throw new Error(message);
    }

    const blob=await response.blob();

    if(capturedObjectUrl){
      URL.revokeObjectURL(capturedObjectUrl);
    }

    capturedObjectUrl=URL.createObjectURL(blob);
    cropRect=null;

    captured.onload=()=>{
      // IMPORTANT:
      // show the capture view BEFORE measuring the image.
      // Measuring while captureMode is display:none makes the canvas 1x1.
      liveMode.classList.add('hidden');
      captureMode.classList.remove('hidden');

      requestAnimationFrame(()=>{
        requestAnimationFrame(()=>{
          resizeCropCanvas();
          clearCropCanvas();
          captureStatus.textContent=
            'Photo captured. Drag a crop around ONLY the roller digits.';
        });
      });
    };

