Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
    captured.src=capturedObjectUrl;
  }

  catch(error){
    captureStatus.textContent=error.message;
    showMessage(error.message,true);
    await backToLive();
  }
}

function recrop(){
  cropRect=null;
  clearCropCanvas();
  captureStatus.textContent='Drag a new crop around ONLY the roller digits.';
}

async function retakePhoto(){
  cropRect=null;
  await takePhoto();
}

async function backToLive(){
  captureMode.classList.add('hidden');
  liveMode.classList.remove('hidden');
  cropRect=null;
  clearCropCanvas();
  await restartStream(false);
}

async function confirmCrop(){
  if(!captured.naturalWidth || !cropRect || cropRect.w<5 || cropRect.h<5){
    showMessage('Draw a crop around the roller digits first.',true);
    return;
  }

  const sx=captured.naturalWidth/canvas.width;
  const sy=captured.naturalHeight/canvas.height;

  const x=Math.round(cropRect.x*sx);
  const y=Math.round(cropRect.y*sy);
  const w=Math.round(cropRect.w*sx);
  const h=Math.round(cropRect.h*sy);

  const before=parseInt(document.getElementById('digitsBefore').value||'0');
  const after=parseInt(document.getElementById('digitsAfter').value||'0');

  if(before+after<=0 || before+after>16){
    showMessage('Total digits must be between 1 and 16.',true);
    return;
  }

  captureStatus.textContent='Running mechanical template OCR...';
  document.getElementById('readingValue').textContent='...';
  document.getElementById('readingInfo').textContent='Processing on ESP32-CAM...';
  document.getElementById('resultDetails').textContent='Reading...';

  try{
    const url=
      `/read?x=${x}&y=${y}&w=${w}&h=${h}&before=${before}&after=${after}`;

    const response=await fetch(url,{cache:'no-store'});
    const data=await response.json();

    if(!response.ok || !data.success){
      throw new Error(data.message||'Mechanical OCR failed');
    }

    document.getElementById('readingValue').textContent=data.reading;

    const countOk=data.detected===data.expected;

    document.getElementById('readingValue').style.color=
      countOk?'#3fb950':'#d29922';

    document.getElementById('readingInfo').textContent=
      `Detected ${data.detected}/${data.expected} digits · Score ${data.average_score} · ${data.rgb565_rescue?'RGB565 rescue':'Python mask'}`;

    let details=
      `RAW: ${data.raw}\n`+
      `FINAL: ${data.reading}\n`+
      `EXPECTED DIGITS: ${data.expected}\n`+
      `DETECTED DIGITS: ${data.detected}\n`+
      `AVERAGE TEMPLATE SCORE: ${data.average_score}\n`+
      `AVERAGE MARGIN: ${data.average_margin}\n`+
      `MASK: S < ${data.sat_limit}${data.rgb565_rescue?' (RGB565 rescue)':' (Python baseline)'}\n\n`;

    for(const d of data.digits){
      details+=
        `Digit ${d.index}: ${d.digit}`+
        ` | score=${d.score}`+
        ` | 2nd=${d.second} (${d.second_score})`+
        ` | box=[${d.x},${d.y},${d.w},${d.h}]\n`;
    }

    if(!countOk){
      details+=
        `\nCHECK: expected ${data.expected} digits but detected ${data.detected}.`;
    }

    document.getElementById('resultDetails').textContent=details;

    captureStatus.textContent=
      countOk
        ?'Mechanical reading complete.'
        :'Reading complete, but digit count needs review.';

    showMessage('Mechanical OCR complete.');
  }

  catch(error){
    document.getElementById('readingValue').textContent='FAILED';
    document.getElementById('readingValue').style.color='#f85149';
    document.getElementById('readingInfo').textContent=error.message;
    document.getElementById('resultDetails').textContent=error.message;
    captureStatus.textContent='Mechanical OCR failed.';
    showMessage(error.message,true);
  }
}

let controlTimer=null;

function rangeChanged(name,value){
  document.getElementById(name+'Value').textContent=value;

  clearTimeout(controlTimer);

  controlTimer=setTimeout(()=>{
    setControl(name,value);
  },120);
}

function toggleChanged(name,checked){
  setControl(name,checked?1:0);
}

function selectChanged(name,value){
  setControl(name,value);
}

async function setControl(name,value){
  try{
    const response=await fetch(
      `/control?var=${encodeURIComponent(name)}&val=${encodeURIComponent(value)}`,
      {cache:'no-store'}
    );

    const data=await response.json();

    if(!response.ok || !data.success){
      throw new Error(data.message||'Camera control failed');
    }
  }

  catch(error){
    showMessage(error.message,true);
  }
}

async function resetCameraDefaults(){
  const ranges={
    brightness:0,
    contrast:0,
    saturation:0,
    sharpness:0,
    denoise:0,
    aeLevel:0,
    aecValue:300,
    agcGain:0,
    flashBrightness:80,
    captureWarmupMs:700,
    framesToDiscard:4
  };

  const toggles={
    whiteBalance:true,
    awbGain:true,
    exposureControl:true,
    aec2:false,
    gainControl:true,
    blackPixelCorrection:true,
    whitePixelCorrection:true,
    rawGamma:true,
    lensCorrection:true,
    downsize:true,
    horizontalMirror:false,
    verticalFlip:false,
    flashEnabled:false
  };

  const selects={
    specialEffect:0,
    wbMode:0,
    gainCeiling:2
  };

  for(const [key,value] of Object.entries(ranges)){
    const el=document.getElementById(key);
    if(el)el.value=value;

    const valueEl=document.getElementById(key+'Value');
    if(valueEl)valueEl.textContent=value;
  }

  for(const [key,value] of Object.entries(toggles)){
    const el=document.getElementById(key);
    if(el)el.checked=value;
  }

  for(const [key,value] of Object.entries(selects)){
    const el=document.getElementById(key);
    if(el)el.value=String(value);
  }

  try{
    const response=await fetch(
      '/defaults',
      {method:'POST',cache:'no-store'}
    );

    const data=await response.json();

    if(!response.ok || !data.success){
      throw new Error(data.message||'Reset failed');
    }

    showMessage('Camera defaults applied.');
  }

  catch(error){
    showMessage(error.message,true);
  }
}

updateExpectedDigits();
restartStream(false);
</script>

</body>
</html>
)HTML";

static esp_err_t indexHandler(httpd_req_t* req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  return httpd_resp_send(req, INDEX_HTML, HTTPD_RESP_USE_STRLEN);
}

static esp_err_t controlHandler(httpd_req_t* req) {
  String variable;
  int value = 0;

