Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
  if (!getQueryString(req, "var", variable) ||
      !getQueryInt(req, "val", value)) {
    return sendJson(
        req,
        "{\"success\":false,\"message\":\"var and val are required\"}",
        400);
  }

  bool sensorSetting = true;

  if (variable == "brightness") {
    camUi.brightness = constrain(value, -2, 2);
  }

  else if (variable == "contrast") {
    camUi.contrast = constrain(value, -2, 2);
  }

  else if (variable == "saturation") {
    camUi.saturation = constrain(value, -2, 2);
  }

  else if (variable == "sharpness") {
    camUi.sharpness = constrain(value, -2, 2);
  }

  else if (variable == "denoise") {
    camUi.denoise = constrain(value, 0, 8);
  }

  else if (variable == "specialEffect") {
    camUi.specialEffect = constrain(value, 0, 6);
  }

  else if (variable == "whiteBalance") {
    camUi.whiteBalance = value != 0;
  }

  else if (variable == "awbGain") {
    camUi.awbGain = value != 0;
  }

  else if (variable == "wbMode") {
    camUi.wbMode = constrain(value, 0, 4);
  }

  else if (variable == "exposureControl") {
    camUi.exposureControl = value != 0;
  }

  else if (variable == "aec2") {
    camUi.aec2 = value != 0;
  }

  else if (variable == "aeLevel") {
    camUi.aeLevel = constrain(value, -2, 2);
  }

  else if (variable == "aecValue") {
    camUi.aecValue = constrain(value, 0, 1200);
  }

  else if (variable == "gainControl") {
    camUi.gainControl = value != 0;
  }

  else if (variable == "agcGain") {
    camUi.agcGain = constrain(value, 0, 30);
  }

  else if (variable == "gainCeiling") {
    camUi.gainCeiling = constrain(value, 0, 6);
  }

  else if (variable == "blackPixelCorrection") {
    camUi.blackPixelCorrection = value != 0;
  }

  else if (variable == "whitePixelCorrection") {
    camUi.whitePixelCorrection = value != 0;
  }

  else if (variable == "rawGamma") {
    camUi.rawGamma = value != 0;
  }

  else if (variable == "lensCorrection") {
    camUi.lensCorrection = value != 0;
  }

  else if (variable == "downsize") {
    camUi.downsize = value != 0;
  }

  else if (variable == "horizontalMirror") {
    camUi.horizontalMirror = value != 0;
  }

  else if (variable == "verticalFlip") {
    camUi.verticalFlip = value != 0;
  }

  else if (variable == "flashEnabled") {
    camUi.flashEnabled = value != 0;
    sensorSetting = false;
  }

  else if (variable == "flashBrightness") {
    camUi.flashBrightness = constrain(value, 0, 255);
    sensorSetting = false;
  }

  else if (variable == "captureWarmupMs") {
    camUi.captureWarmupMs = constrain(value, 0, 3000);
    sensorSetting = false;
  }

  else if (variable == "framesToDiscard") {
    camUi.framesToDiscard = constrain(value, 0, 5);
    sensorSetting = false;
  }

  else {
    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Unknown camera control\"}",
        400);
  }

  if (sensorSetting) {
    if (xSemaphoreTake(cameraMutex, pdMS_TO_TICKS(1500)) == pdTRUE) {
      applyCameraUiSettings();
      xSemaphoreGive(cameraMutex);
    }

    else {
      return sendJson(
          req,
          "{\"success\":false,\"message\":\"Camera is busy\"}",
          500);
    }
  }

  return sendJson(req, "{\"success\":true}");
}

static esp_err_t defaultsHandler(httpd_req_t* req) {
  camUi = CameraUiSettings();

  if (xSemaphoreTake(cameraMutex, pdMS_TO_TICKS(1500)) == pdTRUE) {
    applyCameraUiSettings();
    xSemaphoreGive(cameraMutex);
  }

  else {
    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Camera is busy\"}",
        500);
  }

  return sendJson(req, "{\"success\":true}");
}

static float estimateJpegCenterBrightness(
    const uint8_t* jpeg,
    size_t jpegLength) {
  // XGA 1024x768 / 4 = 256x192.
  constexpr int WIDTH = 256;
  constexpr int HEIGHT = 192;

  const size_t bytes =
      static_cast<size_t>(
          WIDTH) *
      HEIGHT *
      sizeof(uint16_t);

  uint16_t* preview =
      static_cast<uint16_t*>(
          heap_caps_malloc(
              bytes,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!preview) {
    return -1.0f;
  }

  const bool decoded =
      jpg2rgb565(
          jpeg,
          jpegLength,
          reinterpret_cast<uint8_t*>(
              preview),
          JPG_SCALE_4X);

  if (!decoded) {
    free(preview);

    return -1.0f;
  }

  uint64_t total = 0;
  uint32_t count = 0;

  // Central 80% only.
  for (int y = 19;
       y < 173;
       ++y) {
    for (int x = 26;
         x < 230;
         ++x) {
      const uint16_t pixel =
          preview[
              y *
                  WIDTH +
              x];

      const uint8_t r =
          static_cast<uint8_t>(
              ((((pixel >> 11) &
                 0x1F) *
                255U) /
               31U));

      const uint8_t g =
          static_cast<uint8_t>(
              ((((pixel >> 5) &
                 0x3F) *
                255U) /
               63U));

      const uint8_t b =
          static_cast<uint8_t>(
              (((pixel &
                 0x1F) *
                255U) /
               31U));

      const uint16_t luma =
          static_cast<uint16_t>(
              (77U * r +
               150U * g +
               29U * b) >>
              8);

      total +=
          luma;

      count++;
    }
  }

  free(preview);

  if (count == 0) {
    return -1.0f;
  }

  return
      static_cast<float>(
          total) /
      count;
}

static bool switchSensorForCapture() {
  sensor_t* sensor =
      esp_camera_sensor_get();

  if (!sensor) {
    return false;
  }

  // IMPORTANT:
  // Do NOT re-apply AEC/AGC/AWB immediately after changing resolution.
  // That can restart automatic exposure and cause a dark first still.
  const int frameResult =
      sensor->set_framesize(
          sensor,
          CAPTURE_FRAME_SIZE);

  const int qualityResult =
      sensor->set_quality(
          sensor,
          CAPTURE_JPEG_QUALITY);

  return
      frameResult == 0 &&
      qualityResult == 0;
}

static void restoreSensorForLive() {
  setFlashBrightness(0);

  sensor_t* sensor =
      esp_camera_sensor_get();

  if (!sensor) {
    return;
  }

  sensor->set_framesize(
      sensor,
      STREAM_FRAME_SIZE);

  sensor->set_quality(
      sensor,
      STREAM_JPEG_QUALITY);

  // Restore exact user camera controls only after returning to VGA.
  applyCameraUiSettings();

  delay(120);

  for (int i = 0;
       i < 2;
       ++i) {
    camera_fb_t* transition =
        esp_camera_fb_get();

