Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
    if (transition) {
      esp_camera_fb_return(
          transition);
    }

    delay(40);
  }
}

static esp_err_t captureHandler(httpd_req_t* req) {
  // Fully release the live MJPEG client before changing sensor mode.
  streamPauseRequested =
      true;

  const uint32_t waitStarted =
      millis();

  while (
      streamClientActive &&
      millis() -
              waitStarted <
          STREAM_STOP_TIMEOUT_MS) {
    delay(20);
  }

  if (streamClientActive) {
    streamPauseRequested =
        false;

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Live stream did not release camera. Restart livecam and try again.\"}",
        503);
  }

  if (xSemaphoreTake(
          cameraMutex,
          pdMS_TO_TICKS(
              CAMERA_MUTEX_TIMEOUT_MS)) !=
      pdTRUE) {
    streamPauseRequested =
        false;

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Camera mutex timeout\"}",
        503);
  }

  sensor_t* sensor =
      esp_camera_sensor_get();

  if (!sensor ||
      !switchSensorForCapture()) {
    restoreSensorForLive();

    xSemaphoreGive(
        cameraMutex);

    streamPauseRequested =
        false;

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"OV2640 rejected XGA still mode\"}",
        500);
  }

  delay(160);

  if (camUi.flashEnabled) {
    setFlashBrightness(
        static_cast<uint8_t>(
            constrain(
                camUi.flashBrightness,
                0,
                255)));
  }

  else {
    setFlashBrightness(0);
  }

  // Accuracy-first exposure settling.
  const int warmupMs =
      max(
          camUi.captureWarmupMs,
          900);

  delay(
      warmupMs);

  const int discardedFrames =
      max(
          camUi.framesToDiscard,
          5);

  for (int i = 0;
       i < discardedFrames;
       ++i) {
    camera_fb_t* transition =
        esp_camera_fb_get();

    if (transition) {
      esp_camera_fb_return(
          transition);
    }

    delay(65);
  }

  camera_fb_t* frame =
      esp_camera_fb_get();

  if (!frame) {
    restoreSensorForLive();

    xSemaphoreGive(
        cameraMutex);

    streamPauseRequested =
        false;

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Camera returned no XGA frame\"}",
        500);
  }

  // Measure the ACTUAL still. If it is dark, discard it and take one
  // exposure-boosted retry. Live settings are restored afterward.
  const float firstBrightness =
      estimateJpegCenterBrightness(
          frame->buf,
          frame->len);

  if (camUi.exposureControl &&
      firstBrightness >= 0.0f &&
      firstBrightness <
          STILL_DARK_MEAN_THRESHOLD) {
    esp_camera_fb_return(
        frame);

    frame =
        nullptr;

    if (sensor->set_ae_level) {
      sensor->set_ae_level(
          sensor,
          firstBrightness <
                  62.0f
              ? 2
              : 1);
    }

    if (sensor->set_brightness) {
      sensor->set_brightness(
          sensor,
          max(
              1,
              camUi.brightness));
    }

    if (sensor->set_gainceiling) {
      sensor->set_gainceiling(
          sensor,
          static_cast<gainceiling_t>(
              max(
                  3,
                  camUi.gainCeiling)));
    }

    if (sensor->set_aec2) {
      sensor->set_aec2(
          sensor,
          1);
    }

    delay(1000);

    for (int i = 0;
         i < 3;
         ++i) {
      camera_fb_t* transition =
          esp_camera_fb_get();

      if (transition) {
        esp_camera_fb_return(
            transition);
      }

      delay(80);
    }

    frame =
        esp_camera_fb_get();
  }

  if (!frame) {
    restoreSensorForLive();

    xSemaphoreGive(
        cameraMutex);

    streamPauseRequested =
        false;

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Camera returned no final still frame\"}",
        500);
  }

  if (frame->format !=
      PIXFORMAT_JPEG) {
    esp_camera_fb_return(
        frame);

    restoreSensorForLive();

    xSemaphoreGive(
        cameraMutex);

    streamPauseRequested =
        false;

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Camera did not return JPEG\"}",
        500);
  }

  clearLatestJpeg();

  latestJpeg =
      static_cast<uint8_t*>(
          heap_caps_malloc(
              frame->len,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!latestJpeg) {
    esp_camera_fb_return(
        frame);

    restoreSensorForLive();

    xSemaphoreGive(
        cameraMutex);

    streamPauseRequested =
        false;

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Not enough PSRAM to retain still image\"}",
        500);
  }

  memcpy(
      latestJpeg,
      frame->buf,
      frame->len);

  latestJpegLen =
      frame->len;

  latestJpegW =
      frame->width;

  latestJpegH =
      frame->height;

  httpd_resp_set_type(
      req,
      "image/jpeg");

  httpd_resp_set_hdr(
      req,
      "Cache-Control",
      "no-store");

  char contentLength[24];

  snprintf(
      contentLength,
      sizeof(
          contentLength),
      "%u",
      static_cast<unsigned int>(
          frame->len));

  httpd_resp_set_hdr(
      req,
      "Content-Length",
      contentLength);

  const esp_err_t response =
      httpd_resp_send(
          req,
          reinterpret_cast<const char*>(
              frame->buf),
          frame->len);

  esp_camera_fb_return(
      frame);

  restoreSensorForLive();

  xSemaphoreGive(
      cameraMutex);

  streamPauseRequested =
      false;

  return response;
}

static esp_err_t readHandler(httpd_req_t* req) {
  if (!latestJpeg ||
      latestJpegLen == 0) {
    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Take a photo first\"}",
        400);
  }

  int x;
  int y;
  int w;
  int h;
  int before;
  int after;

  if (!getQueryInt(
          req,
          "x",
          x) ||
      !getQueryInt(
          req,
          "y",
          y) ||
      !getQueryInt(
          req,
          "w",
          w) ||
      !getQueryInt(
          req,
          "h",
          h) ||
      !getQueryInt(
          req,
          "before",
          before) ||
      !getQueryInt(
          req,
          "after",
          after)) {
    return sendJson(
        req,
        "{\"success\":false,\"message\":\"Missing crop or digit configuration\"}",
        400);
  }

  const float scaleX =
      static_cast<float>(
          DECODE_W) /
      latestJpegW;

  const float scaleY =
      static_cast<float>(
          DECODE_H) /
      latestJpegH;

