Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
  int decodeX =
      static_cast<int>(
          roundf(
              x *
              scaleX));

  int decodeY =
      static_cast<int>(
          roundf(
              y *
              scaleY));

  int decodeWidth =
      static_cast<int>(
          roundf(
              w *
              scaleX));

  int decodeHeight =
      static_cast<int>(
          roundf(
              h *
              scaleY));

  decodeX =
      constrain(
          decodeX,
          0,
          DECODE_W - 1);

  decodeY =
      constrain(
          decodeY,
          0,
          DECODE_H - 1);

  decodeWidth =
      constrain(
          decodeWidth,
          1,
          DECODE_W -
              decodeX);

  decodeHeight =
      constrain(
          decodeHeight,
          1,
          DECODE_H -
              decodeY);

  const size_t decodeBytes =
      static_cast<size_t>(
          DECODE_W) *
      DECODE_H *
      sizeof(uint16_t);

  uint16_t* rgb565 =
      static_cast<uint16_t*>(
          heap_caps_malloc(
              decodeBytes,
              MALLOC_CAP_SPIRAM |
                  MALLOC_CAP_8BIT));

  if (!rgb565) {
    return sendJson(
        req,
        "{\"success\":false,\"message\":\"PSRAM decode allocation failed\"}",
        500);
  }

  // XGA JPEG -> full XGA RGB565.
  // No old XGA -> 800x600 downsample.
  const bool decoded =
      jpg2rgb565(
          latestJpeg,
          latestJpegLen,
          reinterpret_cast<uint8_t*>(
              rgb565),
          JPG_SCALE_NONE);

  if (!decoded) {
    free(rgb565);

    return sendJson(
        req,
        "{\"success\":false,\"message\":\"JPEG decode failed\"}",
        500);
  }

  MechanicalOcrResult result = {};

  const bool ok =
      mechanicalReadRgb565(
          rgb565,
          DECODE_W,
          DECODE_H,
          decodeX,
          decodeY,
          decodeWidth,
          decodeHeight,
          before,
          after,
          &result);

  free(rgb565);

  if (!ok) {
    String json =
        "{\"success\":false,\"message\":\"";

    json +=
        result.error;

    json +=
        "\"}";

    return sendJson(
        req,
        json,
        500);
  }

  String json;
  json.reserve(2200);

  json +=
      "{\"success\":true";

  json +=
      ",\"reading\":\"" +
      String(
          result.reading) +
      "\"";

  json +=
      ",\"raw\":\"" +
      String(
          result.raw) +
      "\"";

  json +=
      ",\"expected\":" +
      String(
          result.expectedDigits);

  json +=
      ",\"detected\":" +
      String(
          result.detectedDigits);

  json +=
      ",\"average_score\":" +
      String(
          result.averageScore,
          4);

  json +=
      ",\"average_margin\":" +
      String(
          result.averageMargin,
          4);

  json +=
      ",\"sat_limit\":" +
      String(
          result.saturationLimitUsed);

  json +=
      ",\"rgb565_rescue\":" +
      String(
          result.rgb565RescueUsed
              ? "true"
              : "false");

  json +=
      ",\"digits\":[";

  for (int i = 0;
       i <
           result.detectedDigits;
       ++i) {
    if (i) {
      json += ",";
    }

    const MechanicalDigitResult& digit =
        result.digits[i];

    json += "{";

    json +=
        "\"index\":" +
        String(i + 1);

    json +=
        ",\"digit\":\"" +
        String(
            digit.digit) +
        "\"";

    json +=
        ",\"score\":" +
        String(
            digit.score,
            4);

    json +=
        ",\"second\":\"" +
        String(
            digit.secondDigit) +
        "\"";

    json +=
        ",\"second_score\":" +
        String(
            digit.secondScore,
            4);

    json +=
        ",\"x\":" +
        String(
            digit.component.x);

    json +=
        ",\"y\":" +
        String(
            digit.component.y);

    json +=
        ",\"w\":" +
        String(
            digit.component.w);

    json +=
        ",\"h\":" +
        String(
            digit.component.h);

    json += "}";
  }

  json += "]}";

  Serial.printf(
      "MECHANICAL FINAL: %s | %d/%d | avg=%.3f margin=%.3f | S<%d%s\n",
      result.reading,
      result.detectedDigits,
      result.expectedDigits,
      result.averageScore,
      result.averageMargin,
      result.saturationLimitUsed,
      result.rgb565RescueUsed
          ? " RGB565_RESCUE"
          : "");

  return sendJson(
      req,
      json);
}

static esp_err_t streamHandler(httpd_req_t* req) {
  static const char* STREAM_CONTENT_TYPE =
      "multipart/x-mixed-replace;boundary=frame";

  static const char* STREAM_BOUNDARY =
      "\r\n--frame\r\n";

  static const char* STREAM_PART =
      "Content-Type: image/jpeg\r\n"
      "Content-Length: %u\r\n\r\n";

  esp_err_t result =
      httpd_resp_set_type(
          req,
          STREAM_CONTENT_TYPE);

  if (result != ESP_OK) {
    return result;
  }

  streamClientActive = true;

  while (!streamPauseRequested) {
    if (xSemaphoreTake(cameraMutex, pdMS_TO_TICKS(1200)) != pdTRUE) {
      delay(15);
      continue;
    }

    camera_fb_t* frame =
        esp_camera_fb_get();

    if (!frame) {
      xSemaphoreGive(cameraMutex);
      delay(80);
      continue;
    }

    if (frame->format != PIXFORMAT_JPEG) {
      esp_camera_fb_return(frame);
      xSemaphoreGive(cameraMutex);
      delay(60);
      continue;
    }

    char part[64];

    const int hlen =
        snprintf(
            part,
            sizeof(part),
            STREAM_PART,
            static_cast<unsigned int>(frame->len));

    result =
        httpd_resp_send_chunk(
            req,
            STREAM_BOUNDARY,
            strlen(STREAM_BOUNDARY));

    if (result == ESP_OK) {
      result =
          httpd_resp_send_chunk(
              req,
              part,
              hlen);
    }

    if (result == ESP_OK) {
      result =
          httpd_resp_send_chunk(
              req,
              reinterpret_cast<const char*>(
                  frame->buf),
              frame->len);
    }

