Jasimsiddiquii/analog_esp32cam/esp32_cam_analog_final.ino
    esp_camera_fb_return(frame);
    xSemaphoreGive(cameraMutex);

    if (result != ESP_OK) {
      break;
    }

    delay(70);
  }

  streamClientActive = false;
  return result;
}

static bool initCamera() {
  initialiseFlashPWM();
  setFlashBrightness(0);

  camera_config_t config = {};

  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;

  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;

  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;

  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;

  // Initialize at XGA so PSRAM buffers are already large enough for stills.
  config.frame_size = CAPTURE_FRAME_SIZE;
  config.jpeg_quality = 10;
  config.fb_count = 1;
  config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
  config.fb_location = CAMERA_FB_IN_PSRAM;

  if (!psramFound()) {
    Serial.println("ERROR: PSRAM not found");
    return false;
  }

  const esp_err_t error =
      esp_camera_init(&config);

  if (error != ESP_OK) {
    Serial.printf(
        "ERROR: camera init 0x%X\n",
        error);

    return false;
  }

  cameraMutex = xSemaphoreCreateMutex();

  if (!cameraMutex) {
    Serial.println("ERROR: camera mutex failed");
    return false;
  }

  sensor_t* sensor =
      esp_camera_sensor_get();

  if (sensor) {
    sensor->set_framesize(
        sensor,
        STREAM_FRAME_SIZE);

    sensor->set_quality(
        sensor,
        STREAM_JPEG_QUALITY);
  }

  applyCameraUiSettings();

  for (int i = 0; i < 2; ++i) {
    camera_fb_t* frame =
        esp_camera_fb_get();

    if (frame) {
      esp_camera_fb_return(frame);
    }

    delay(100);
  }

  return true;
}

static void startServers() {
  httpd_config_t mainConfig =
      HTTPD_DEFAULT_CONFIG();

  mainConfig.server_port =
      MAIN_SERVER_PORT;

  mainConfig.max_uri_handlers =
      10;

  mainConfig.stack_size =
      8192;

  mainConfig.lru_purge_enable =
      true;

  if (httpd_start(
          &mainServer,
          &mainConfig) !=
      ESP_OK) {
    Serial.println("ERROR: main HTTP server failed");
    return;
  }

  httpd_uri_t indexUri = {};
  indexUri.uri = "/";
  indexUri.method = HTTP_GET;
  indexUri.handler = indexHandler;
  httpd_register_uri_handler(mainServer, &indexUri);

  httpd_uri_t captureUri = {};
  captureUri.uri = "/capture";
  captureUri.method = HTTP_GET;
  captureUri.handler = captureHandler;
  httpd_register_uri_handler(mainServer, &captureUri);

  httpd_uri_t readUri = {};
  readUri.uri = "/read";
  readUri.method = HTTP_GET;
  readUri.handler = readHandler;
  httpd_register_uri_handler(mainServer, &readUri);

  httpd_uri_t controlUri = {};
  controlUri.uri = "/control";
  controlUri.method = HTTP_GET;
  controlUri.handler = controlHandler;
  httpd_register_uri_handler(mainServer, &controlUri);

  httpd_uri_t defaultsUri = {};
  defaultsUri.uri = "/defaults";
  defaultsUri.method = HTTP_POST;
  defaultsUri.handler = defaultsHandler;
  httpd_register_uri_handler(mainServer, &defaultsUri);

  httpd_config_t streamConfig =
      HTTPD_DEFAULT_CONFIG();

  streamConfig.server_port =
      STREAM_SERVER_PORT;

  streamConfig.ctrl_port =
      mainConfig.ctrl_port + 1;

  streamConfig.max_uri_handlers =
      4;

  streamConfig.stack_size =
      8192;

  streamConfig.lru_purge_enable =
      true;

  if (httpd_start(
          &streamServer,
          &streamConfig) !=
      ESP_OK) {
    Serial.println("ERROR: stream HTTP server failed");
    return;
  }

  httpd_uri_t streamUri = {};
  streamUri.uri = "/stream";
  streamUri.method = HTTP_GET;
  streamUri.handler = streamHandler;
  httpd_register_uri_handler(streamServer, &streamUri);
}

void setup() {
  Serial.begin(115200);
  delay(500);

  if (!initCamera()) {
    while (true) {
      delay(1000);
    }
  }

  WiFi.mode(WIFI_AP);

  if (!WiFi.softAP(
          AP_SSID,
          AP_PASSWORD)) {
    Serial.println("ERROR: AP failed");

    while (true) {
      delay(1000);
    }
  }

  WiFi.setSleep(false);

  startServers();

  Serial.println();
  Serial.println("======================================");
  Serial.println("MECHANICAL OCR V2 READY");
  Serial.print("Wi-Fi: ");
  Serial.println(AP_SSID);
  Serial.print("Open: http://");
  Serial.println(WiFi.softAPIP());
  Serial.println("Live stream: port 81");
  Serial.println("======================================");
}

void loop() {
  delay(250);
}
